phygeonet-master/case3/TemplateCase0.1/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.487159 -0.245384 0.005)
(-0.467275 -0.245384 0.005)
(-0.447391 -0.245384 0.005)
(-0.427507 -0.245384 0.005)
(-0.407623 -0.245384 0.005)
(-0.387739 -0.245384 0.005)
(-0.367855 -0.245384 0.005)
(-0.347971 -0.245384 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.497095 -0.245375 0.005)
(-0.491293 -0.236119 0.005)
(-0.485511 -0.22685 0.005)
(-0.479765 -0.217558 0.005)
(-0.474069 -0.208235 0.005)
(-0.468439 -0.198873 0.005)
(-0.462889 -0.189462 0.005)
(-0.457438 -0.179995 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.497095 -0.245375 0.005)
(0.491293 -0.236119 0.005)
(0.485511 -0.22685 0.005)
(0.479765 -0.217558 0.005)
(0.474069 -0.208235 0.005)
(0.468439 -0.198873 0.005)
(0.462889 -0.189462 0.005)
(0.457438 -0.179995 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.25 0.005)
(-0.47 0.25 0.005)
(-0.45 0.25 0.005)
(-0.43 0.25 0.005)
(-0.41 0.25 0.005)
(-0.39 0.25 0.005)
(-0.37 0.25 0.005)
(-0.35 0.25 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.25 0.005)
(-0.47 -0.25 0.005)
(-0.45 -0.25 0.005)
(-0.43 -0.25 0.005)
(-0.41 -0.25 0.005)
(-0.39 -0.25 0.005)
(-0.37 -0.25 0.005)
(-0.35 -0.25 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
